
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДокументРеализация = Параметры.ДокументРеализация;
	ПроВЦ_СтатусЗаказа = ПредопределенноеЗначение("Перечисление.ПроВЦ_СтатусРеализацииПоЗаказу.Собран");
	ПроВЦ_КоличествоКоробок = Параметры.ДокументРеализация.ПроВЦ_КоличествоКоробок;
	ПроВЦ_КоличествоПакетов = Параметры.ДокументРеализация.ПроВЦ_КоличествоПакетов;
	ПроВЦ_КомментарийКладовщика = Параметры.ДокументРеализация.ПроВЦ_КомментарийКладовщика;
КонецПроцедуры

&НаКлиенте
Процедура Собран(Команда)
	ИзменитьДокумент();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ИзменитьДокумент()
	ОбъектДок = ДокументРеализация.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(ОбъектДок,ЭтотОбъект);
	ОбъектДок.Записать();
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
